ibrahim_folder/cases/fan_11/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform (10 0 0);
  }
  outlet
  {
    type zeroGradient;
  }
  upperWall
  {
    type noSlip;
  }
  lowerWall
  {
    type noSlip;
  }
  frontAndBack
  {
    type empty;
  }
  walls
  {
    type noSlip;
  }
  pressure_outlet
  {
    inletValue uniform (0 0 0);
    type pressureInletOutletVelocity;
    value uniform (0 0 0);
  }
  velocity_inlet
  {
    type fixedValue;
    value uniform (0.0 0.0 1.0);
  }
} 	// ************************************************************************* //

